In [1]:
import sqlite3

In [2]:
conn = sqlite3.connect("internship.db")
cursor = conn.cursor()

In [3]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS interns (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    track TEXT NOT NULL,
    stipend INTEGER
)
""")

In [4]:
cursor.executemany("""
INSERT INTO interns (id, name, track, stipend)
VALUES (?, ?, ?, ?)
""", [
    (1, 'Aarav', 'Data Science', 15000),
    (2, 'Riya', 'Web Development', 12000),
    (3, 'Kabir', 'Data Science', 18000),
    (4, 'Meera', 'Cyber Security', 20000),
    (5, 'Arjun', 'Web Development', 14000)
])

In [5]:
conn.commit()

In [6]:
cursor.execute("SELECT name, track FROM interns")
rows = cursor.fetchall()

for row in rows:
    print(row)

('Aarav', 'Data Science')
('Riya', 'Web Development')
('Kabir', 'Data Science')
('Meera', 'Cyber Security')
('Arjun', 'Web Development')

In [7]:
conn.close()

In [8]:
import pandas as pd

conn = sqlite3.connect("internship.db")
df = pd.read_sql_query("SELECT name, track FROM interns", conn)
df

    name            track
0  Aarav     Data Science
1   Riya  Web Development
2  Kabir     Data Science
3  Meera   Cyber Security
4  Arjun  Web Development